[
  { 
    "id": "citizens-connect", 
    "title": "Citizens Connect",
    "type": "UX Case Study",
    "date": "2014",
    "blurb": [
      "Citizens Connect is the online service portal of the City of Boston website. While its award-winning mobile app counterpart is clean and user-friendly, the website is basically an overwhelming site map. With the help of two colleagues, Geetha Pai and Hamy Pham, I decided to try redesigning it in less than two weeks.",
      "In order to make user flows more efficient and intuitive, we started by determining a new information architecture (IA) for the ~100 services provided on the portal. We then fleshed out these user flows into sketches of the redesigned site’s distinct types of pages. While Geetha wire-framed and user-tested the new flow, Hamy set out to create a style-guide for the new site. I, meanwhile, started coding the site\u0027s layout and structure.",
      "It was a mad dash to the finish-line (I had about 1.5 days to implement the site\u0027s final design), but we made it. The resulting site is a usable and intuitive resource for Boston\u0027s residents."
    ],
    "images": [
      {
        "source": "img/citizens_connect/payparkingticket.png",
        "caption": "All current experience flows for paying a parking ticket",
        "alt": "flow of current site"
      },
      {
        "source": "img/citizens_connect/sketch2.png",
        "caption": "Sketch of the new design",
        "alt": "sketch of the new design"
      },
      {
        "source": "img/citizens_connect/wireframe_hp.gif",
        "caption": "Wireframe for the new homepage",
        "alt": "wireframe of new site"
      },
      {
        "source": "img/citizens_connect/citizens_UI.png",
        "caption": "Design for the new site",
        "alt": "design of new site"
      },
      {
        "source": "img/citizens_connect/beforeNafter.png",
        "caption": "Comparison of the site before and after the redesign",
        "alt": "before\/after comparison of the site"
      }
    ]
  },
  { 
    "id": "coded-styleguide", 
    "title": "Coded Style Guide",
    "type": "Development",
    "date": "2014",
    "blurb": [
      "While at Fresh Tilled Soil (FTS), I was tasked with the creation of a coded style-guide for a prominent financial institution in New England. The client was currently in the midst of a re-brand for their website and mobile applications, and while they reached out to FTS primarily to design the rebrand, it was clear that they would also benefit from code guidance as well.",
      "Using the Adobe Photoshop design template provided by designers at FTS (for visuals), and the website prototype provided by the client (for content), I created code snippets for all aspects of the site, including: layout, color, typography, and stand-alone components. These code samples provided the client with standards for how the site should be coded - they were clean, semantic, accessible, and compatible with all browsers back to IE8."
    ],
    "images": [
      {
        "source": "img/styleguide/style-guide.png",
        "caption": "The current site",
        "alt": "the current site"
      }
    ]
  },
  { 
    "id": "aux-bootcamp", 
    "title": "What Should We Watch?",
    "type": "UX Design Exercise",
    "date": "2014",
    "blurb": [
      "As a \"design bootcamp\" of sorts, I decided to design a single-function mobile app from conception to high-fidelity prototype in two weeks. I decided to tackle a problem that I often encountered - choosing a movie to watch with friends on Netflix.",
      "I ran several interviews and sent out a survey, quickly finding that a) I was not alone in experiencing this problem and b) a long decision process often stems from people\u0027s reluctance to re-watch movies. This led me to design What Should We Watch?, an app that works on top of users\u0027 existing Netflix accounts to hide movies already seen movies. Friends can connect with each other to browse movies and shows not seen by any of the party."
    ],
    "images": [
      {
        "source": "img/bootcamp/decision-flow.png",
        "caption": "The Decision flow for picking a Netflix movie to watch",
        "alt": "decision flow for picking a Netflix movie"
      },
      {
        "source": "img/bootcamp/thought-process.png",
        "caption": "How I went about finding solutions to the problem",
        "alt": "flow of solution process"
      },
      {
        "source": "img/bootcamp/low-fi_proto.png",
        "caption": "Low-fidelity prototype of the app: What Should We Watch",
        "alt": "low-fi prototype of solution"
      },
      {
        "source": "img/bootcamp/bootcamp_pickfriends.png",
        "caption": "What Should We Watch: including group members",
        "alt": "coded solution - step 1"
      },
      {
        "source": "img/bootcamp/bootcamp_movies.png",
        "caption": "What Should We Watch: movie suggestions",
        "alt": "coded solution - step 1"
      }
    ]
  },
  { 
    "id": "goalmometer", 
    "title": "Goalmometer",
    "type": "HCI Research",
    "date": "2011",
    "blurb": [
      "There is a distinct lack of tools that accurately measure progress and\/or productivity. Instead, we see a plethora of tools that reduce work into quantifiable measures (hours, pages, actions), erasing equally important measures like emotion, effort, and concentration. Cornell University\u0027s Reimagination Lab, led by Professor Dan Cosley, set out to change this.",
      "Our objective was to design a digital tool that simulated people\u0027s mental model of goal management. Through interviews with Cornell students and related research, we decided to focus on a tool that visualized the user\u0027s progress, and had a social component to allow for others' support. This led to the development of Pact:",
      "\"[Pact is] a social application in which groups of friends can collaborate toward goal achievement… Pact allows individuals to set personally achievable goals, yet encourages both collaboration and competition by allowing friends to compare measurable progress and hold each other accountable.\" [1]",
      "1. Porges, Z., Yang, X., Desai, A., Ho, C., Pallegedara, R., Razzaque, R., Cosley, D. (2014). Achieve: Evaluating the Impact of Progress Logging and Social Feedback on Goal Achievement"
    ],
    "images": [
      {
        "source": "img/goalmometer/thesis-thermo2.png",
        "caption": "The inspiration: Thesis Thermometer",
        "alt": "thesis thermometer"
      },
      {
        "source": "img/goalmometer/Danco-Proto.png",
        "caption": "Tool idea #1: digitized thesis thermometer",
        "alt": "brainstorm idea #1"
      },
      {
        "source": "img/goalmometer/Erica-Proto.png",
        "caption": "Tool idea #2: generates a picture as user complete tasks",
        "alt": "brainstorm idea #2"
      }
    ]
  },
  { 
    "id": "being-heard", 
    "title": "Being Heard",
    "type": "HCI Research",
    "date": "2010",
    "blurb": [
      "The abundance of data being collected by social media provides us with a rich resource of communication habits. Cornell University\u0027s Reimagination Lab, led by Professor Dan Cosley, decided to tap into this resource to help people better understand how well they communicate with others.",
      "The first iteration of this research focused on asynchronous media channels and led to \"PieTime\", a data visualization tool that mapped archived email and phone message volume to time. The second iteration, which I was involved with, focused on synchronous media channels. \"Being Heard\" is a Firefox extension that visualizes a user\u0027s Google Chat history qualitatively (via a word cloud) and quantitatively (via a graph showing chat volume mapped over time)."
    ],
    "images": [
      {
        "source": "img/being_heard/pieTime.png",
        "caption": "First iteration - PieTime",
        "alt": "PieTime"
      },
      {
        "source": "img/being_heard/er-diagram.png",
        "caption": "ER Diagram for Being Heard",
        "alt": "ER diagram"
      },
      {
        "source": "img/being_heard/beingheard-proto.png",
        "caption": "\"Night\" and \"Day\" prototypes of the second iteration",
        "alt": "second iteration"
      }
    ]
  }
]